package emil.l5WhileLoops;
// Напишете програма, която да използва while loop и да отпечатва числа от едно до N.
// Сравнете я с аналогична програма, която използва for loop.

public class Ex2 {
    public static void main(String[] args) {
        int n = 10;
   //     int i = 1;
  //      while( i <= n) {
   //         System.out.println(i++); // i++ Нараства с 1 ,т.е ако имаме само i ще принтим 1 безкрай!
        for (int i = 1; i <= n ; i++) {
            System.out.println(i);
        }
        }
    }

    // Ползваме While лупа когато , не знаем колко итерации ше се направят. Пример е когато потребителя вкарва име и
    // парола , ние не знаем колко пъти той ще напише паролата ако , тя е грешна , за това се ползва While loops.

    // for лупа се предпочита за използване , защото само от първия ред разбираме какво ше се изпълнява, по удобно за
    // работа.
